In [2]:
import pandas as pd
data=pd.read_csv("C:/Users/deva/Downloads/StudentsPerformance.csv")

In [3]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

### count of males and females that participated

In [17]:

data[data['gender']=='female']["gender"].count()

518

In [18]:
data[data['gender']=='male']["gender"].count()

482

### Info about parental level of education of students

In [21]:
data["parental level of education"].unique()

array(['some high school', 'high school', 'some college',
       "associate's degree", "bachelor's degree", "master's degree"],
      dtype=object)

In [22]:
for i in data['parental level of education'].unique():
    print(f"count of '{i}' is {data[data['parental level of education']==i]['parental level of education'].count()}")

count of 'some high school' is 179
count of 'high school' is 196
count of 'some college' is 226
count of 'associate's degree' is 222
count of 'bachelor's degree' is 118
count of 'master's degree' is 59

### Person scores the most in average of math, reading skill, writing skill

In [29]:
data[data['gender']=='female'][data[data['gender']=='female'][['math score','reading score','writing score']].mean(1).max()==data[data['gender']=='female'][['math score','reading score','writing score']].mean(1)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100

In [30]:
data[data['gender']=='male'][data[data['gender']=='male'][['math score','reading score','writing score']].mean(1).max()==data[data['gender']=='male'][['math score','reading score','writing score']].mean(1)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [32]:
data[data['test preparation course']=='none'][data[data['test preparation course']=='none'][['math score','reading score','writing score']].mean(1).max()==data[data['test preparation course']=='none'][['math score','reading score','writing score']].mean(1)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
516,female,group E,bachelor's degree,standard,none,100,100,100
517,female,group E,associate's degree,standard,none,100,100,100

In [33]:
data[data['test preparation course']=='completed'][data[data['test preparation course']=='completed'][['math score','reading score','writing score']].mean(1).max()==data[data['test preparation course']=='completed'][['math score','reading score','writing score']].mean(1)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
999,male,group E,bachelor's degree,standard,completed,100,100,100

#### Scoring variation for math, reading skill, speaking skill based on gender and test preparation course

In [38]:
data[data['gender']=='male'][['math score','reading score','writing score']].mean(0)

math score       68.821577
reading score    65.545643
writing score    63.446058
dtype: float64

In [39]:
data[data['gender']=='male'][['math score','reading score','writing score']].std(0)

math score       14.556411
reading score    14.149594
writing score    14.227225
dtype: float64

In [40]:
data[data['gender']=='female'][['math score','reading score','writing score']].mean(0)

math score       63.376448
reading score    72.590734
writing score    72.467181
dtype: float64

In [41]:
data[data['gender']=='female'][['math score','reading score','writing score']].std(0)

math score       16.029928
reading score    14.411018
writing score    14.844842
dtype: float64

In [43]:
data[data['test preparation course']=='completed'][['math score','reading score','writing score']].mean(0)

math score       69.966480
reading score    74.175978
writing score    74.684358
dtype: float64

In [44]:
data[data['test preparation course']=='completed'][['math score','reading score','writing score']].std(0)

math score       14.521847
reading score    13.537572
writing score    13.236412
dtype: float64

In [45]:
data[data['test preparation course']=='none'][['math score','reading score','writing score']].mean(0)

math score       63.789720
reading score    66.417445
writing score    64.457944
dtype: float64

In [46]:
data[data['test preparation course']=='none'][['math score','reading score','writing score']].std(0)

math score       15.705689
reading score    14.608896
writing score    15.041667
dtype: float64

#### Returns the top 25% of students based on their math score

In [42]:
data[data['math score'].quantile(q=.8)<data['math score']]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
444,female,group B,associate's degree,standard,none,80,86,83
445,female,group D,some college,standard,none,80,90,89
446,female,group D,some high school,standard,none,80,90,82
447,female,group D,some high school,standard,completed,80,92,88
448,female,group E,bachelor's degree,standard,none,80,83,83
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100